pyocd/pyOCD/pyocd/debug/svd/data/ATSAML11D16A.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="NVMCTRL">
         <name>NVMCTRL_SEC</name>
         <prependToName>NVMCTRL_SEC_</prependToName>
         <baseAddress>0x41005000</baseAddress>
      </peripheral>
      <peripheral>
         <name>OPAMP</name>
         <version>U22372.0.0</version>
         <description>Operational Amplifier</description>
         <groupName>OPAMP</groupName>
         <prependToName>OPAMP_</prependToName>
         <baseAddress>0x42003000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x11</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control A</description>
               <addressOffset>0x0</addressOffset>
               <size>8</size>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>LPMUX</name>
                     <description>Low-Power Mux</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status</description>
               <addressOffset>0x2</addressOffset>
               <size>8</size>
               <access>read-only</access>
               <resetValue>0x00</resetValue>
               <fields>
                  <field>
                     <name>READY0</name>
                     <description>OPAMP 0 Ready</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>READY1</name>
                     <description>OPAMP 1 Ready</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>READY2</name>
                     <description>OPAMP 2 Ready</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPAMPCTRL0</name>
               <description>OPAMP0 Control</description>
               <addressOffset>0x4</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Operational Amplifier Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANAOUT</name>
                     <description>Analog Output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIAS</name>
                     <description>Bias Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RES2VCC</name>
                     <description>Resistor ladder To VCC</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES2OUT</name>
                     <description>Resistor ladder To Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1EN</name>
                     <description>Resistor 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1MUX</name>
                     <description>Resistor 1 Mux</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RES1MUXSelect</name>
                        <enumeratedValue>
                           <name>OAxPOS</name>
                           <description>Positive inout of OPAMPx</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OAxNEG</name>
                           <description>Negative input of OPAMPx</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DAC</name>
                           <description>DAC output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RG_CONN</name>
                           <description>RG_CONN</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POTMUX</name>
                     <description>Potentiometer Selection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>POTMUXSelect</name>
                        <enumeratedValue>
                           <name>14R_2R</name>
                           <description>R1 = 14R, R2 = 2R</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12R_4R</name>
                           <description>R1 = 12R, R2 = 4R</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8R_8R</name>
                           <description>R1 = 8R, R2 = 8R</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6R_10R</name>
                           <description>R1 = 6R, R2 = 10R</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4R_12R</name>
                           <description>R1 = 4R, R2 = 12R</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3R_13R</name>
                           <description>R1 = 3R, R2 = 13R</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2R_14R</name>
                           <description>R1 = 2R, R2 = 14R</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>R_15R</name>
                           <description>R1 = 1R, R2 = 15R</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXPOS</name>
                     <description>Positive Input Mux Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MUXPOSSelect</name>
                        <enumeratedValue>
                           <name>OA0POS</name>
                           <description>Positive I/O pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0TAP</name>
                           <description>Resistor ladder 0 taps</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFERENCE_DAC</name>
                           <description>REFERENCE or DAC output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXNEG</name>
                     <description>Negative Input Mux Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MUXNEGSelect</name>
                        <enumeratedValue>
                           <name>OA0NEG</name>
                           <description>Negative I/O pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0TAP</name>
                           <description>Resistor ladder 0 taps</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFERENCE_DAC</name>
                           <description>REFERENCE or DAC output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0OUT</name>
                           <description>OPAMP0 output</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OPAMPCTRL1</name>
               <description>OPAMP1 Control</description>
               <addressOffset>0x8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ENABLE</name>
                     <description>Operational Amplifier Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ANAOUT</name>
                     <description>Analog Output</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BIAS</name>
                     <description>Bias Selection</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>RES2VCC</name>
                     <description>Resistor ladder To VCC</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>Run in Standby</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ONDEMAND</name>
                     <description>On Demand Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES2OUT</name>
                     <description>Resistor ladder To Output</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1EN</name>
                     <description>Resistor 1 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RES1MUX</name>
                     <description>Resistor 1 Mux</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>RES1MUXSelect</name>
                        <enumeratedValue>
                           <name>OAxPOS</name>
                           <description>Positive inout of OPAMPx</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OAxNEG</name>
                           <description>Negative input of OPAMPx</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0OUT</name>
                           <description>OPAMP0 output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RG_CONN</name>
                           <description>RG_CONN</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>POTMUX</name>
                     <description>Potentiometer Selection</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>POTMUXSelect</name>
                        <enumeratedValue>
                           <name>14R_2R</name>
                           <description>R1 = 14R, R2 = 2R</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>12R_4R</name>
                           <description>R1 = 12R, R2 = 4R</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>8R_8R</name>
                           <description>R1 = 8R, R2 = 8R</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>6R_10R</name>
                           <description>R1 = 6R, R2 = 10R</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>4R_12R</name>
                           <description>R1 = 4R, R2 = 12R</description>
                           <value>4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>3R_13R</name>
                           <description>R1 = 3R, R2 = 13R</description>
                           <value>5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>2R_14R</name>
                           <description>R1 = 2R, R2 = 14R</description>
                           <value>6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>R_15R</name>
                           <description>R1 = 1R, R2 = 15R</description>
                           <value>7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXPOS</name>
                     <description>Positive Input Mux Selection</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MUXPOSSelect</name>
                        <enumeratedValue>
                           <name>OA1POS</name>
                           <description>Positive I/O pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA1TAP</name>
                           <description>Resistor ladder 1 taps</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFERENCE_DAC</name>
                           <description>REFERENCE or DAC output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>GND</name>
                           <description>Ground</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0OUT</name>
                           <description>OPAMP0 output</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>MUXNEG</name>
                     <description>Negative Input Mux Selection</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>4</bitWidth>
                     <enumeratedValues>
                        <name>MUXNEGSelect</name>
                        <enumeratedValue>
                           <name>OA0NEG</name>
                           <description>Negative I/O pin</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0TAP</name>
                           <description>Resistor ladder 0 taps</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>REFERENCE_DAC</name>
                           <description>REFERENCE or DAC output</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>OA0OUT</name>
                           <description>OPAMP0 output</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
